MPS/src/Catalogs/ТочкиСценарияДействие/ТочкиСценарияДействие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТочкиСценарияДействие</name>
  <owners>Catalog.Сценарии</owners>
  <attributes>
    <name>ПериодАктуальности</name>
    <type>
      <types>EnumRef.ПериодыДействий</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовАктуальности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ФильтрПоДействиямВКампаниях</name>
    <attributes>
      <name>ВидДействияВКампании</name>
      <type>
        <types>CatalogRef.ВидыДействияВКампаниях</types>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоследовательностьДействий</name>
    <attributes>
      <name>ВидДействия</name>
      <type>
        <types>CatalogRef.ВидыДействийКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Канал</name>
      <type>
        <types>CatalogRef.КаналыВзаимодействия</types>
      </type>
    </attributes>
    <attributes>
      <name>Рассылка</name>
      <type>
        <types>DefinedType.Кампании</types>
      </type>
    </attributes>
    <attributes>
      <name>СегментПартнеров</name>
      <type>
        <types>CatalogRef.СегментыПартнеров</types>
      </type>
    </attributes>
    <attributes>
      <name>СписокПродуктов</name>
      <type>
        <types>CatalogRef.СпискиПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаборПромокодов</name>
      <type>
        <types>CatalogRef.НаборыПромокодов</types>
      </type>
    </attributes>
    <attributes>
      <name>БалльныйСчет</name>
      <type>
        <types>CatalogRef.ВидыБалльныхСчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособИзмененияКоличества</name>
      <type>
        <types>EnumRef.СпособыИзмененияКоличества</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзменениеКоличества</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСрокаНачисленияБаллов</name>
      <type>
        <types>EnumRef.ВидыСроковНачисленияБаллов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСрокаНачисленияБаллов</name>
      <comment>До этой даты будут действовать начисленные баллы</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПериодовДействияНачисленныхБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПериодДействияНачисленныхБаллов</name>
      <type>
        <types>EnumRef.ПериодыДействий</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеПараметровДействия</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

MPS/src/Catalogs/ВидыДействийКлиента/ВидыДействийКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДействийКлиента</name>
  <predefined>
    <items>
      <name>ОткрытиеРассылки</name>
      <description>Открытие рассылки</description>
    </items>
    <items>
      <name>КликПоСсылкеВРассылке</name>
      <description>Клик по ссылке в рассылке</description>
    </items>
    <items>
      <name>ОтпискаОтРассылки</name>
      <description>Отписка от рассылки</description>
    </items>
    <items>
      <name>ОтправкаРассылки</name>
      <description>Отправка рассылки</description>
    </items>
    <items>
      <name>РассылкаНеДоставлена</name>
      <description>Рассылка не доставлена</description>
    </items>
    <items>
      <name>РассылкаНеОтправлялась</name>
      <description>Рассылка не отправлялась</description>
    </items>
    <items>
      <name>АвтоматическоеСписаниеНеиспользованныхБаллов</name>
      <description>Автоматическое списание неиспользованных баллов</description>
    </items>
    <items>
      <name>ИзменениеБалансаБалловПоДействию</name>
      <description>Изменение баланса баллов по действию</description>
    </items>
    <items>
      <name>КорректировкаБаланса</name>
      <description>Корректировка баланса</description>
    </items>
    <items>
      <name>КлиентПрименилПромокод</name>
      <description>Клиент применил промокод</description>
    </items>
    <items>
      <name>КлиентуВыданПромокод</name>
      <description>Клиенту выдан промокод</description>
    </items>
    <items>
      <name>СозданиеКлиента</name>
      <description>Создание клиента</description>
    </items>
    <items>
      <name>РегистрацияКлиента</name>
      <description>Регистрация клиента</description>
    </items>
    <items>
      <name>АвторизацияКлиента</name>
      <description>Авторизация клиента</description>
    </items>
    <items>
      <name>АктивацияКарты</name>
      <description>Активация карты</description>
    </items>
    <items>
      <name>ЗапрошенКодАвторизацииВОперации</name>
      <description>Запрошен код авторизации в операции</description>
    </items>
    <items>
      <name>ИзменениеМобильногоТелефона</name>
      <description>Изменение мобильного телефона</description>
    </items>
    <items>
      <name>ИзменениеEmail</name>
      <description>Изменение Email</description>
    </items>
    <items>
      <name>ИзменениеЧасовогоПоясаКлиентовПриИзмененииРегиона</name>
      <description>Изменение часового пояса клиентов при изменении региона</description>
    </items>
    <items>
      <name>ПодтверждениеМобильногоТелефона</name>
      <description>Подтверждение мобильного телефона</description>
    </items>
    <items>
      <name>ПодтверждениеEmail</name>
      <description>Подтверждение Email</description>
    </items>
    <items>
      <name>РедактированиеКлиента</name>
      <description>Изменение данных клиента</description>
    </items>
    <items>
      <name>СтатусПодпискиИзменен</name>
      <description>Статус подписки изменен</description>
    </items>
    <items>
      <name>СозданиеЗаказа</name>
      <description>Создание заказа</description>
    </items>
    <items>
      <name>СозданиеЗаказаНеавторизованнымПользователем</name>
      <description>Создание заказа неавторизованным пользователем</description>
    </items>
    <items>
      <name>СохранениеЗаказа</name>
      <description>Сохранение заказа</description>
    </items>
    <items>
      <name>ИзменениеСтатусаЗаказа</name>
      <description>Изменение статуса заказа</description>
    </items>
    <items>
      <name>ОтменаЗаказа</name>
      <description>Отмена заказа</description>
    </items>
    <items>
      <name>ИзменениеДанныхЗаказа</name>
      <description>Изменение данных заказа</description>
    </items>
    <items>
      <name>ПродуктВЗаказеОплачен</name>
      <description>Продукт в заказе оплачен</description>
    </items>
    <items>
      <name>ПродуктВЗаказеДоставлен</name>
      <description>Продукт в заказе доставлен</description>
    </items>
    <items>
      <name>КлиентПопалВСегмент</name>
      <description>Клиент попал в сегмент</description>
    </items>
    <items>
      <name>КлиентВышелИзСегмента</name>
      <description>Клиент вышел из сегмента</description>
    </items>
    <items>
      <name>КликВInApp</name>
      <description>Клик в in-app</description>
    </items>
    <items>
      <name>КликВPopup</name>
      <description>Клик в popup</description>
    </items>
    <items>
      <name>КликПоПродуктуВВиджете</name>
      <description>Клик по продукту в виджете</description>
    </items>
    <items>
      <name>ОтказОтРекламы</name>
      <description>Отказ от рекламы</description>
    </items>
    <items>
      <name>ПереходНаСайт</name>
      <description>Переход на сайт</description>
    </items>
    <items>
      <name>КлиентПокинулСайтИлиПриложение</name>
      <description>Клиент покинул сайт (приложение)</description>
    </items>
    <items>
      <name>ПоказInApp</name>
      <description>Показ in-app</description>
    </items>
    <items>
      <name>ПоказВиджета</name>
      <description>Показ виджета</description>
    </items>
    <items>
      <name>ПоказPopup</name>
      <description>Показ popup</description>
    </items>
    <items>
      <name>ПользовательЗапретилПолучениеМобильныхПушей</name>
      <description>Пользователь запретил получение мобильных пушей</description>
    </items>
    <items>
      <name>ПользовательРазрешилПолучениеМобильныхПушей</name>
      <description>Пользователь разрешил получение мобильных пушей</description>
    </items>
    <items>
      <name>ПросмотрКатегорииПродуктов</name>
      <description>Просмотр категории продуктов</description>
    </items>
    <items>
      <name>ПросмотрПродуктаВОперации</name>
      <description>Просмотр продукта в операции</description>
    </items>
    <items>
      <name>УстановкаМобильногоПриложения</name>
      <description>Установка мобильного приложения</description>
    </items>
    <items>
      <name>УстановкаСпискаПродуктов</name>
      <description>Установка списка продуктов</description>
    </items>
    <items>
      <name>ДобавлениеПродуктаВСписок</name>
      <description>Добавление продукта в список</description>
    </items>
    <items>
      <name>ИзменилсяПродуктВСписке</name>
      <description>Изменился продукт в списке</description>
    </items>
    <items>
      <name>ИзменилсяПросмотренныйПродукт</name>
      <description>Изменился просмотренный продукт</description>
    </items>
    <items>
      <name>ДействиеВКампании</name>
      <description>Действие в кампании...</description>
    </items>
  </predefined>
  <attributes>
    <name>КодДействия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеКодыMindBox</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеВидаОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодДействияMindBox</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Системный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

MPS/src/Catalogs/КаналыВзаимодействия/КаналыВзаимодействия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаналыВзаимодействия</name>
  <predefined>
    <items>
      <name>offLine</name>
      <description>Касса магазина</description>
    </items>
    <items>
      <name>Website</name>
      <description>Cайт</description>
    </items>
    <items>
      <name>Mobile</name>
      <description>Приложения iOS и Android</description>
    </items>
    <items>
      <name>SMS</name>
      <description>SMS</description>
    </items>
    <items>
      <name>Email</name>
      <description>Email</description>
    </items>
  </predefined>
</mdclass:Catalog>

MPS/src/Catalogs/ТочкиСценарияДействие/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПоследовательностьДействийВидДействияПриИзменении(Элемент)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СВД = Справочники.ВидыДействийКлиента;
	ЭВД = Элементы.ПоследовательностьДействийВидДействия;
	
	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Отправка рассылки");
	ВидыПараметров = Новый Структура("СтраницаПараметров,ВидДействия,Канал","ОтправкаРассылки_Страница",СВД.ОтправкаРассылки,Справочники.КаналыВзаимодействия.Email);
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"E-mail расылка" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров.Канал = Справочники.КаналыВзаимодействия.SMS;
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"SMS расылка" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров.Канал = Справочники.КаналыВзаимодействия.Mobile;
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"Мобильный пуш" , , БиблиотекаКартинок.Пустая);
	ВидыПараметров.Канал = Справочники.КаналыВзаимодействия.Website;
	ЭВД.СписокВыбора.Добавить(ВидыПараметров	,	"Веб пуш " , , БиблиотекаКартинок.Пустая);


	УправлениеФормамиПКМП.ДобавитьСтрокуГруппыСписка(ЭВД.СписокВыбора, "Действия");
	ВидыПараметров = Новый Структура("СтраницаПараметров,ВидДействия","ДействияВКампаниях_Страница",СВД.ДействиеВКампании);
	ЭВД.СписокВыбора.Добавить(СВД.ДействиеВКампании, "Действие в кампании..." , , БиблиотекаКартинок.Пустая);
КонецПроцедуры
